//
//  asset.swift
//  CodeBaseUI
//
//  Created by 유철원 on 6/4/24.
//

import Foundation

let movieDict: [String: [String]] = [
    "1" : ["응원하고픈", "흥미진진", "감동적인", "한국작품"],
    "2" : ["판타지","애니메이션", "성장하는", "외국작품"],
    "3" : ["유쾌한","긴장감있는","사극","한국작품"],
    "4" : ["괴수","가족애", "서스펜스","한국작품"],
    "5" : ["감동적인", "드라마", "가슴뛰는","한국작품"],
    "극한직업" : ["코미디", "요리", "형사","한국작품"],
    "도둑들" :  ["통쾌한", "범죄", "액션", "한국작품"],
    "명량" : ["응원하고픈", "흥미진진", "전투", "사극", "한국작품"],
    "베테랑" : ["통쾌한", "범죄", "액션", "한국작품"],
    "부산행" :  ["좀비", "아포칼립스", "액션","한국작품"],
    "신과함께인과연" : ["판타지", "시리즈", "감동적인", "한국작품"],
    "신과함께죄와벌" : ["판타지", "시리즈", "감동적인", "한국작품"],
    "아바타" : ["SF", "시리즈", "웅장한", "전투", "외국작품"],
    "알라딘" : ["판타지", "애니메이션", "로맨스", "외국작품"],
    "암살" : ["긴장감있는", "첩보", "사극", "한국작품"],
    "어벤져스엔드게임" : ["액션", "시리즈", "히어로", "외국작품"],
    "왕의남자" : ["감성적인", "로맨스", "사극", "한국작품"],
    "태극기휘날리며" : ["전쟁", "가족애","드라마","한국작품"],
    "택시운전사" : ["논픽션","긴장감있는","비극적인","한국작품"],
    "해운대" : ["재난", "드라마", "웅장한", "한국작품"]
]
